# =========================== Question 1 ===========================
    def move(self): # 根據方向移動蛇的坐標
        # 請注意，蛇頭在佇列中是rear，蛇尾在佇列中是front，方向是相反的！！
        # 遊戲中每一格是30*30px(像素)，所以不管往哪個方向移動，都必須以30px為最小單位
        # 此類別有個self.g(=30)屬性，可以直接使用此屬性來計算蛇下一個移動座標，每次最多移動一格
        # 當或許新的座標之後，必須改變self.snake內的所有節點座標來移動
        # self.dir 有四種可能性 "up" "down" "left" "right"，請針對這四種不同的狀況給出相對應的移動座標
        # Hint需要用到： self.snake  self.dir  self.g
# =========================== Question 2 ===========================
    def add_tail(self): # 加一個節點到玩家蛇的尾端(此方法是在蛇吃掉食物的時候被呼叫)
        # 在玩家蛇的尾端(front)新增一個節點
        # 新節點的座標要往蛇尾的方向延伸
        # 此節點座標也需要以30px為一個增減單位，可用使用self.g(=30)
        # Hint需要用到： self.snake  self.g  Node()
# =========================== Question 3 ===========================
    def eat_body(self): # 吃到玩家蛇的身體
        # 若玩家蛇頭吃到玩家蛇身體任一節點
        # 則刪除從該節點開始～蛇尾的所有節點
        # Hint需要用到： self.snake
        # 若寫完功能正常，可在判斷式區塊內加入一行『self.play_effect("eat_body")』，即可撥放音效
# =========================== Question 4 ===========================
    def eat_item(self): # 吃到道具方塊(黃色問號)即獲得道具
        # 若吃到道具方塊，則在道具列表(self.item_list)內隨機選擇一個道具
        # 並把道具存放到背包堆疊(self.backpack)中
        # 再把道具方塊座標(self.itemBoxPos)重設成None
        # Hint需要用到： self.snake  self.itemBoxPos  self.item_list  random.randrange()  self.backpack
        # 若寫完功能正常，可在判斷式區塊內加入一行『self.play_effect("eat_item")』，即可撥放音效
        if self.itemBoxPos != None: # 若道具方塊有顯現的話

# =========================== Question 5 ===========================
    def use_item(self): # 使用道具
        # 使用背包(self.backpack)中最新拿到的道具
        # 最新拿到的道具會儲存在背包堆疊的頂端(top)
        # 背包堆疊中的每個節點都有一個item屬性，此屬性儲存道具名稱的字串
        # 一定要用『self.item』儲存堆疊頂端的道具名稱，並依據名稱啟用不同的道具(否則會有bug)
        # 要啟用相對應道具，只需要把該道具的參數調成True即可(預設都是False)
        # 例如：使用了Brake(剎車)道具，就把self.item_Brake改成True即可
        # 同時必須刪除背包堆疊頂端的道具
# ==================================================================